mariopartyrd/partyboard/src/REL/m408Dll/stage.c
#include "game/chrman.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/wipe.h"

#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/sprite.h"

#include "game/audio.h"
#include "game/gamework_data.h"

#include "REL/m408Dll.h"

#include "ext_math.h"
#include "math.h"

s32 lbl_1_bss_160[2];
AnimData *lbl_1_bss_14C[5];
s16 lbl_1_bss_148;
s32 lbl_1_bss_144;
u32 lbl_1_bss_140;
omObjData *lbl_1_bss_13C;
s32 lbl_1_bss_138;
s32 lbl_1_bss_134;
s32 lbl_1_bss_130;
HsfConstData *lbl_1_bss_128[2];
void *lbl_1_bss_120[2];
HsfDrawData *lbl_1_bss_11C;
s16 lbl_1_bss_118;

float lbl_1_data_198 = 1000;
u32 lbl_1_data_19C = 0x41C64E6D;

void fn_1_C4E4(Process *objman);

void fn_1_C44C(Process *objman)
{
    s32 i;
    lbl_1_bss_144 = 0;
    lbl_1_bss_140 = 0;
    lbl_1_bss_138 = lbl_1_bss_134 = lbl_1_bss_130 = -1;
    fn_1_C4E4(objman);
    for (i = 0; i < (frand() & 0x7F); i++) {
        fn_1_11670();
    }
}

void fn_1_C530(omObjData *object);

void fn_1_C4E4(Process *objman)
{
    lbl_1_bss_13C = omAddObjEx(objman, 30, 35, 0, -1, fn_1_C530);
}

typedef struct work_f4b0 {
    s16 unk0;
    s16 unk2;
    GXColor *unk4;
    HuVec2f *unk8;
    u8 *unkC;
    union {
        s16 unk10[32];
        float unk10_f[16];
    };
} WorkF4B0;

void fn_1_CD14(omObjData *object);

s16 fn_1_D978(AnimData *arg0, s16 arg1, ParticleHook arg2);
void fn_1_E310(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_EEF8(ModelData *model, ParticleData *particle, Mtx matrix);

WorkF4B0 *fn_1_F4B0(s16 arg0, s16 arg1);

void fn_1_C530(omObjData *object)
{
    s32 temp_r31;
    float *temp_r29;
    s32 temp_r28;

    u16 *spC;
    WorkF4B0 *sp8;
    object->data = spC = HuMemDirectMallocNum(HEAP_SYSTEM, 436 * sizeof(u16), MEMORY_DEFAULT_NUM);
    lbl_1_bss_14C[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M408, 0x24), MEMORY_DEFAULT_NUM));
    lbl_1_bss_14C[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M408, 0x25), MEMORY_DEFAULT_NUM));
    lbl_1_bss_14C[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M408, 0x26), MEMORY_DEFAULT_NUM));
    lbl_1_bss_14C[4] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M408, 0x28), MEMORY_DEFAULT_NUM));
    lbl_1_bss_14C[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M408, 0x29), MEMORY_DEFAULT_NUM));
    object->model[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1A));
    omSetSca(object, 0.1f, 0.1f, 0.1f);
    temp_r31 = object->model[0];
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    object->model[4] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1E));
    temp_r31 = object->model[4];
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelScaleSet(temp_r31, 0.1f, 0.1f, 0.1f);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    object->model[5] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x20));
    temp_r31 = object->model[5];
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelScaleSet(temp_r31, 0.1f, 0.1f, 0.1f);
    object->model[2] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1B));
    temp_r31 = object->model[2];
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelPosSet(temp_r31, -20, -10, -150);
    Hu3DModelScaleSet(temp_r31, 0.14500001f, 0.14500001f, 0.14500001f);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    object->model[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1D));
    temp_r31 = object->model[3];
    Hu3DModelPosSet(temp_r31, 0, -50, -500);
    Hu3DModelScaleSet(temp_r31, 0.15f, 0.15f, 0.15f);
    Hu3DModelLayerSet(temp_r31, 0);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    sp8 = fn_1_F4B0(temp_r31, temp_r31);
    object->model[9] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1C));
    temp_r31 = object->model[9];
    lbl_1_bss_148 = temp_r31;
    Hu3DModelScaleSet(temp_r31, 0.11000001f, 0.1f, 0.11000001f);
    Hu3DModelPosSet(temp_r31, 0, 10000, 0);
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    object->model[11] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x1F));
    temp_r31 = object->model[11];
    Hu3DModelPosSet(temp_r31, 0, 10000, 0);
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelScaleSet(temp_r31, 0.105f, 0.1f, 0.105f);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    object->model[12] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x23));
    temp_r31 = object->model[12];
    Hu3DModelLayerSet(temp_r31, 3);
    Hu3DModelPosSet(temp_r31, 0, 5000, 0);
    Hu3DModelScaleSet(temp_r31, 0.1f, 0.1f, 0.1f);
    Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
    Hu3DMotionSpeedSet(temp_r31, 0);
    object->model[19] = temp_r31 = fn_1_D978(lbl_1_bss_14C[0], 80, fn_1_E310);
    Hu3DModelLayerSet(temp_r31, 1);
    Hu3DModelPosSet(temp_r31, 0, 5100, 0);
    Hu3DParticleBlendModeSet(temp_r31, 1);
    temp_r29 = ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_1C;
    temp_r29[2] = 140;
    object->model[14] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x21));
    object->model[15] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x22));
    object->model[16] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x21));
    object->model[17] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M408, 0x22));
    for (temp_r28 = 0; temp_r28 < 4; temp_r28++) {
        temp_r31 = object->model[temp_r28 + 14];
        Hu3DModelLayerSet(temp_r31, 3);
        Hu3DModelRotSet(temp_r31, 0, frandmod(360), 0);
        Hu3DModelScaleSet(temp_r31, 0.1f, 0.1f, 0.1f);
        Hu3DModelAttrSet(temp_r31, HU3D_ATTR_DISPOFF);
        Hu3DMotionSpeedSet(temp_r31, 0);
    }
    object->model[6] = temp_r31 = fn_1_D978(lbl_1_bss_14C[4], 1, fn_1_EEF8);
    Hu3DModelPosSet(temp_r31, 0, 5000, 0);
    Hu3DModelLayerSet(temp_r31, 3);
    Hu3DModelAttrReset(temp_r31, HU3D_ATTR_DISPOFF);
    Hu3DParticleBlendModeSet(temp_r31, 1);
    temp_r29 = ((ParticleData *)Hu3DData[temp_r31].unk_120)->unk_1C;
    temp_r29[1] = 800;
    object->func = fn_1_CD14;
}

void fn_1_D004(omObjData *object);

