mariopartyrd/partyboard/src/REL/m408Dll/stage.c
void fn_1_CD14(omObjData *object)
{
    u16 *temp_r30;
    u32 temp_r29;
    temp_r29 = fn_1_6878();
    temp_r30 = object->data;
    switch (temp_r29) {
        case 1:
            temp_r30[0] = 2;
            temp_r30[1] = 0;
            lbl_1_bss_140 = 1;
            break;

        case 2:
        case 3:
            fn_1_D004(object);
            temp_r30[1]++;
            break;

        case 4:
            Hu3DModelScaleSet(object->model[2], 0.16000001f, 0.16000001f, 0.16000001f);
            Hu3DModelShadowMapSet(object->model[0]);
            Hu3DModelShadowSet(object->model[4]);
            break;

        default:
            break;
    }
    if (temp_r29 > 3) {
        if (lbl_1_bss_134 >= 0) {
            HuAudFXStop(lbl_1_bss_134);
            lbl_1_bss_134 = -1;
        }
        if (lbl_1_bss_130 >= 0) {
            HuAudFXStop(lbl_1_bss_130);
            lbl_1_bss_130 = -1;
        }
    }
}

s32 fn_1_CE68(void)
{
    switch (lbl_1_bss_140) {
        case 0:
            return 0;

        case 1:
            if (lbl_1_bss_144) {
                return 2;
            }
            else {
                return 1;
            }
            break;

        case 2:
            if (lbl_1_bss_144) {
                return 3;
            }
            else {
                return 4;
            }
            break;
    }
}

void fn_1_CEEC(void)
{
    omObjData *temp_r31;
    s32 temp_r30;
    temp_r31 = lbl_1_bss_13C;
    if (lbl_1_bss_140 >= 2) {
        return;
    }
    lbl_1_bss_140 = 2;
    Hu3DModelAttrSet(temp_r31->model[5], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(temp_r31->model[9], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(temp_r31->model[11], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(temp_r31->model[12], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(temp_r31->model[19], HU3D_ATTR_DISPOFF);
    for (temp_r30 = 0; temp_r30 < 4; temp_r30++) {
        Hu3DModelAttrSet(temp_r31->model[temp_r30 + 14], HU3D_ATTR_DISPOFF);
    }
    Hu3DModelAttrReset(temp_r31->model[0], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(temp_r31->model[4], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(temp_r31->model[2], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(temp_r31->model[3], HU3D_ATTR_DISPOFF);
}

void fn_1_D6F0(omObjData *object);

void fn_1_D004(omObjData *object)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    u16 *temp_r30;
    float *temp_r28;
    s32 temp_r27;
    s32 temp_r26;
    CameraData *sp8;
    temp_r30 = object->data;
    sp8 = &Hu3DCamera[0];
    temp_f30 = fn_1_6888();
    temp_f28 = 7000;
    switch (temp_r30[0]) {
        case 2:
            Hu3DModelAttrReset(object->model[9], HU3D_ATTR_DISPOFF);
            Hu3DModelAttrReset(object->model[11], HU3D_ATTR_DISPOFF);
            Hu3DModelAttrReset(object->model[12], HU3D_ATTR_DISPOFF);
            Hu3DModelAttrReset(object->model[19], HU3D_ATTR_DISPOFF);
            for (temp_r26 = 0; temp_r26 < 4; temp_r26++) {
                Hu3DModelAttrReset(object->model[temp_r26 + 14], HU3D_ATTR_DISPOFF);
            }
            Hu3DModelAttrReset(object->model[6], HU3D_ATTR_DISPOFF);
            if (lbl_1_bss_134 < 0) {
                lbl_1_bss_134 = HuAudFXPlay(1363);
            }
            temp_r30[2] = 0;
            temp_r30[0]++;

        case 3:
            temp_f31 = temp_r30[1] * 0.25f;
            Hu3DModelRotSet(object->model[9], 0, 0.7f * -temp_f31, 0);
            Hu3DModelRotSet(object->model[11], 0, 1.3f * temp_f31, 0);
            Hu3DModelRotSet(object->model[12], 0, 3.7f * temp_f31, 0);
            temp_f29 = 1.0f - ((temp_f30 - 5000) / 15000);
            Hu3DMotionTimeSet(object->model[12], 95.0f * temp_f29);
            temp_r27 = object->model[6];
            temp_r28 = ((ParticleData *)Hu3DData[temp_r27].unk_120)->unk_1C;
            temp_r28[2] = 1.0f - ((temp_f30 - 5000) / (temp_f28 - 5000));
            if (temp_f30 <= 5400 && temp_r30[2] == 0) {
                temp_r30[2] = 30;
                if (!lbl_1_bss_40) {
                    WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, temp_r30[2]);
                    lbl_1_bss_44 = 1;
                }
                lbl_1_bss_144 = 1;
                temp_r30[0]++;
            }
            if (temp_f30 <= 4800) {
                temp_r28[1] = 1200;
                temp_r30[0]++;
            }
            fn_1_D6F0(object);
            break;

        case 4:
            if (temp_r30[2]-- == 0) {
                if (!lbl_1_bss_40) {
                    WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 30);
                    lbl_1_bss_44 = 0;
                }
                if (lbl_1_bss_138 < 0) {
                    lbl_1_bss_138 = HuAudFXPlay(1357);
                }
                fn_1_CEEC();
                if (lbl_1_bss_134 >= 0) {
                    HuAudFXStop(lbl_1_bss_134);
                    lbl_1_bss_134 = -1;
                }
                if (lbl_1_bss_130 < 0) {
                    lbl_1_bss_130 = HuAudFXPlay(1361);
                }
                temp_r30[0]++;
            }

            break;

        case 5:
            if (!WipeStatGet()) {
                lbl_1_bss_144 = 0;
            }
            temp_r27 = object->model[6];
            if (temp_r27 != 0) {
                Hu3DModelPosSet(temp_r27, 0, 200 + temp_f30, 0);
                temp_r28 = ((ParticleData *)Hu3DData[temp_r27].unk_120)->unk_1C;
                temp_r28[2] -= 0.025f;
                if (temp_r28[2] <= 0) {
                    Hu3DModelAttrReset(temp_r27, HU3D_ATTR_PARTICLE_KILL);
                    Hu3DModelKill(temp_r27);
                    object->model[6] = 0;
                }
            }
            temp_f31 = temp_r30[1] % 360;
            temp_f31 = 0.1f * (1.4f + ((0.2f * temp_f30) / 5000));
            Hu3DModelScaleSet(object->model[2], temp_f31, temp_f31, temp_f31);
            break;
    }
}

void fn_1_D6F0(omObjData *object)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    s32 temp_r31;
    s32 temp_r30;
    s32 temp_r29;
    temp_f28 = fn_1_6888() - 1500;
    temp_f29 = 500.0f * (int)(temp_f28 / 500.0f);
    temp_r30 = (int)(temp_f28 / 500.0f) % 4;
    for (temp_r31 = 0; temp_r31 < 4; temp_r31++) {
        temp_r29 = object->model[temp_r30 + 14];
        Hu3DModelPosSet(temp_r29, 0, temp_f29, 0);
        temp_f31 = temp_f29 - temp_f28;
        temp_f30 = 0;
        if (temp_f31 > -250.0f && temp_f31 < 1525.0f) {
            temp_f30 = 45;
            if (temp_f31 < 0.0f) {
                temp_f31 -= -250.0f;
                temp_f30 *= fabs(temp_f31 / 250.0f);
            }
            else {
                if (temp_f31 > 1425) {
                    temp_f31 -= 1425;
                    temp_f30 *= 1.0 - fabs(temp_f31 / 100.0f);
                }
            }
        }
        Hu3DMotionTimeSet(temp_r29, temp_f30);
        temp_f29 += 500.0f;
        temp_r30 = (temp_r30 + 1) % 4;
    }
}

