mariopartyrd/partyboard/src/REL/m408Dll/stage.c
s16 fn_1_D978(AnimData *arg0, s16 arg1, ParticleHook arg2)
{
    s32 temp_r31;
    HU3DPARTICLEDATA *temp_r30;
    ParticleData *temp_r29;
    s32 temp_r28;
    HU3DPARTICLEDATA *temp_r27;
    temp_r28 = Hu3DParticleCreate(arg0, arg1);
    Hu3DParticleHookSet(temp_r28, arg2);
    Hu3DModelAttrSet(temp_r28, HU3D_ATTR_DISPOFF);
    temp_r29 = Hu3DData[temp_r28].unk_120;
    temp_r27 = temp_r29->data;
    for (temp_r31 = 0; temp_r31 < temp_r29->unk_30; temp_r31++, temp_r27++) {
        temp_r27->unk2C = 0;
    }
    temp_r30 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(HU3DPARTICLEDATA), MEMORY_DEFAULT_NUM);
    temp_r29->unk_1C = temp_r30;
    temp_r30->time = temp_r28;
    temp_r30->unk02 = 0;
    for (temp_r31 = 0; temp_r31 < 32; temp_r31++) {
        // Ugly expression to match store without new type
        *((s16 *)(((u8 *)temp_r30) + (temp_r31 * 2) + 4)) = 0;
    }
    return temp_r28;
}

void fn_1_DA6C(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r29;
    s32 temp_r28;
    s32 temp_r27;
    s16 temp_r26;
    temp_r29 = particle->unk_1C;
    switch (temp_r29->unk_02) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time = 0;
            }
            particle->unk_00 = 0;
            temp_r29->unk_02++;
            temp_r29->unk_04.y = 3;
            temp_r29->unk_04.z = 25;
            break;

        case 1:
            for (temp_r28 = 0; temp_r28 < 100; temp_r28++) {
                temp_r31 = particle->data;
                for (temp_r27 = 0; temp_r27 < particle->unk_30; temp_r27++, temp_r31++) {
                    if (!temp_r31->time) {
                        break;
                    }
                }
                if (temp_r27 == particle->unk_30) {
                    temp_r29->unk_02++;
                    break;
                }
                temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
                temp_r26 = fn_1_11670() % 360;
                temp_r31->unk08.x = sind(temp_r26);
                temp_r31->unk08.y = -6.0 + (2.0 * temp_r29->unk_10.x);
                temp_r31->unk08.z = cosd(temp_r26);
                temp_r31->unk14.x = ((fn_1_11670() & 0x7) + temp_r29->unk_04.z) - 4.0f;
                temp_r31->unk14.x *= 0.1f;
                temp_f31 = temp_r29->unk_04.y + (0.01 * (float)(fn_1_11670() % 400));
                temp_f31 *= 0.1f;
                temp_r31->unk34.x = temp_f31 * temp_r31->unk08.x;
                temp_r31->unk34.y = 0;
                temp_r31->unk34.z = temp_f31 * temp_r31->unk08.z;
                temp_r31->unk2C = (0.01 * (frand() % 2000)) + 30.0;
                temp_r31->unk2C *= 0.1f;
                temp_r31->unk40.a = 255;
                temp_r31->time = 30;
            }
            break;
    }
    temp_r31 = particle->data;
    for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
        if (temp_r31->time == 0) {
            continue;
        }
        temp_f30 = temp_r31->unk14.x;
        temp_r31->unk34.x += temp_r31->unk08.x * temp_f30;
        temp_r31->unk34.y += temp_r31->unk08.y;
        temp_r31->unk34.z += temp_r31->unk08.z * temp_f30;
        temp_r31->unk2C *= 1.025f;
        temp_r31->unk40.a *= 0.95f;
        temp_r31->unk40.a--;
        temp_r31->unk14.x *= 0.8f;
        temp_r31->unk08.y *= 0.85f;
        temp_r31->unk08.y += 0.1f;
        if (temp_r31->unk40.a < 2) {
            temp_r31->unk40.a = 0;
            temp_r31->time = 0;
            particle->unk_00++;
        }
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
    if (particle->unk_00 >= particle->unk_30 && temp_r29->unk_02 == 2) {
        temp_r29->unk_02 = 0;
        Hu3DModelAttrReset(temp_r29->unk_00, HU3D_ATTR_PARTICLE_KILL);
        Hu3DModelKill(temp_r29->unk_00);
    }
}

void fn_1_DFD0(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r30;
    s32 temp_r28;
    s16 temp_r27;
    s32 temp_r26;
    temp_r30 = particle->unk_1C;
    switch (temp_r30->unk_02) {
        case 0:
            temp_r31 = particle->data;
            temp_r30->unk_04.x = 10;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
                temp_r27 = fn_1_11670() % 360;
                temp_r31->unk08.x = sind(temp_r27);
                temp_r31->unk08.y = 0;
                temp_r31->unk08.z = cosd(temp_r27);
                temp_f31 = temp_r30->unk_04.x + (temp_r30->unk_04.x * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->unk34.x = temp_f31 * temp_r31->unk08.x;
                temp_r31->unk34.y = -(100.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->unk34.z = temp_f31 * temp_r31->unk08.z;
                temp_r31->unk2C = (0.01 * (frand() % 2000)) + 40.0;
                temp_r26 = frand() & 0x2F;
                temp_r31->unk40.r = temp_r26 + 208;
                temp_r31->unk40.g = temp_r26 + 208;
                temp_r31->unk40.a = (frand() & 0x5F) + 32;
            }
            temp_r30->unk_02++;
            particle->unk_00 = 60;
            break;

        case 1:
            if (--particle->unk_00 == 0) {
                Hu3DModelAttrReset(temp_r30->unk_00, HU3D_ATTR_PARTICLE_KILL);
                Hu3DModelKill(temp_r30->unk_00);
                return;
            }
            break;
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
}

void fn_1_E310(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r29;
    s32 temp_r28;
    s32 temp_r27;
    s16 temp_r26;
    temp_r29 = particle->unk_1C;
    switch (temp_r29->unk_02) {
        case 0:
            temp_r31 = particle->data;
            temp_f30 = 360.0f / particle->unk_30;

            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time = (s32)(360.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
                temp_r26 = (temp_f30 * temp_r28) + (int)((temp_f30 * 0.5f) * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768)));
                temp_r31->unk20 = temp_r26;
                temp_r31->unk30 = (M_PI * (temp_r26 + 90.0f)) / 180.0;
                temp_r31->unk08.x = sind(temp_r26);
                temp_r31->unk08.y = 0;
                temp_r31->unk08.z = cosd(temp_r26);
                temp_f31 = temp_r29->unk_04.y + ((0.25f * temp_r29->unk_04.y) * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->unk14.x = temp_f31 * temp_r31->unk08.x;
                temp_r31->unk14.y = 120.0 * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768));
                temp_r31->unk14.z = temp_f31 * temp_r31->unk08.z;
                temp_r31->unk24 = temp_r31->unk2C = (0.01 * (frand() % 2000)) + 160;
                if (particle->unk_2C == 1) {
                    temp_r27 = frand() & 0x2F;
                    temp_r31->unk40.r = temp_r27 + 32;
                    temp_r31->unk40.g = temp_r27 + 32;
                    temp_r31->unk40.b = 64 + temp_r27 + ((int)(((46 - temp_r27) * ((1.0 / 65536.0) * (float)fn_1_11670()))));
                    temp_r31->unk40.a = (frand() & 0x2F) + 32;
                }
                else {
                    temp_r27 = frand() & 0x2F;
                    temp_r31->unk40.r = temp_r27 + 208;
                    temp_r31->unk40.g = temp_r27 + 208;
                    temp_r31->unk40.a = (frand() & 0x4F) + 176;
                }
            }
            temp_r29->unk_02++;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time += 4;
                if (temp_r31->time >= 360) {
                    temp_r31->time -= 360;
                }
                temp_r31->unk34.x = temp_r31->unk14.x;
                temp_r31->unk34.y = temp_r31->unk14.y;
                temp_r31->unk34.z = temp_r31->unk14.z;
                temp_r31->unk30 = M_PI * (90 + (temp_r31->unk20 + temp_r29->unk_04.z)) / 180;
                temp_r31->unk2C = temp_r31->unk24 * ((0.1f * sind(temp_r31->time)) + 1.0);
            }
            break;
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
}

