mariopartyrd/partyboard/src/REL/m408Dll/stage.c
void fn_1_E9B4(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f30;
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r30;
    s32 temp_r28;
    s16 temp_r27;
    s32 temp_r26;
    temp_r30 = particle->unk_1C;
    switch (temp_r30->unk_02) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time = fn_1_11670() % 360;
                temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
                temp_r27 = fn_1_11670() % 360;
                temp_r31->unk20 = temp_r27;
                temp_r31->unk08.x = sind(temp_r27);
                temp_r31->unk08.y = 0;
                temp_r31->unk08.z = cosd(temp_r27);
                temp_f31 = temp_r30->unk_04.x + (0.01 * ((30.0f * temp_r30->unk_04.x) * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_f30 = (0.15f + (0.3f * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_r31->unk14.x = temp_f31 * temp_r31->unk08.x;
                temp_r31->unk14.y = 50 * ((1.0 / 32768.0) * (float)(fn_1_11670() - 32768));
                temp_r31->unk14.z = temp_f31 * temp_r31->unk08.z * temp_f30;
                temp_r31->unk24 = temp_r31->unk2C
                    = temp_r30->unk_04.x + (0.01 * ((50.0f * temp_r30->unk_04.x) * ((1.0 / 65536.0) * (float)fn_1_11670())));
                temp_r26 = frand() & 0x7F;
                temp_r31->unk40.r = temp_r26 + 64;
                temp_r31->unk40.g = temp_r26 + 64;
                temp_f31 -= temp_r30->unk_04.x;
                temp_r31->unk40.a
                    = 32 + (int)((48.0f * temp_f31) / (0.2f * temp_r30->unk_04.x)) + (int)(32 * ((1.0 / 65536.0) * (float)fn_1_11670()));
            }
            temp_r30->unk_02++;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time += 2;
                if (temp_r31->time >= 360) {
                    temp_r31->time -= 360;
                }
                temp_r31->unk34.x = temp_r31->unk14.x;
                temp_r31->unk34.y = temp_r31->unk14.y;
                temp_r31->unk34.z = temp_r31->unk14.z;
                temp_r31->unk2C = temp_r31->unk24 * ((0.1f * sind(temp_r31->time)) + 1.0);
            }
            break;
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
}

void fn_1_EEF8(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r29;
    s32 temp_r28;
    u8 temp_r27;
    temp_r29 = particle->unk_1C;
    switch (temp_r29->unk_02) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->unk34.x = temp_r31->unk34.y = temp_r31->unk34.z = 0;
                temp_r31->unk40.r = temp_r31->unk40.g = temp_r31->unk40.b = temp_r31->unk40.a = 255;
                temp_r31->unk2C = temp_r29->unk_04.x;
            }
            temp_r29->unk_02++;
            break;

        case 1:
            if (temp_r29->unk_04.y < 0.0f) {
                break;
            }
            temp_f31 = 0.1f + temp_r29->unk_04.y;
            temp_f31 = 1.2f * (temp_f31 * temp_f31);
            if (temp_f31 > 1.0f) {
                temp_f31 = 1.0f;
            }
            temp_r27 = 255 * temp_f31;
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->unk40.a = temp_r27;
            }
            break;
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
}

void fn_1_F06C(ModelData *model, ParticleData *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    ParticleData *temp_r29;
    s32 temp_r28;
    s16 temp_r27;
    temp_r27 = 0;
    temp_r29 = particle->unk_1C;
    switch (temp_r29->unk_02) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                temp_r31->time = temp_r31->unk02 = 0;
            }
            temp_r29->unk_02++;
            break;

        case 1:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->unk_30; temp_r28++, temp_r31++) {
                if (temp_r31->time) {
                    temp_r31->time--;
                    continue;
                }
                if (temp_r31->unk02 == 0) {
                    temp_f31 = 360.0f * ((1.0 / 65536.0) * (float)fn_1_11670());
                    temp_r31->unk34.x = 10.0 * (50.0 + (250.0 * ((1.0 / 65536.0) * (float)fn_1_11670()))) * sind(temp_f31);
                    temp_r31->unk34.y = 0;
                    temp_r31->unk34.z = 10.0 * (50.0 + (250.0 * ((1.0 / 65536.0) * (float)fn_1_11670()))) * cosd(temp_f31);
                    temp_r31->unk30 = (M_PI * (temp_f31 - 90.0f)) / 180;
                    temp_r31->unk40.r = temp_r31->unk40.g = temp_r31->unk40.b = temp_r31->unk40.a = 192;
                    temp_r31->unk40.b = 160;
                    temp_r31->unk2C = 0;
                    temp_r31->time = (s32)(90.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                    temp_r31->unk02 = 60;
                }
                temp_r31->unk40.a = 248 * sind(temp_r31->unk02 * 3);
                temp_r31->unk2C = temp_r29->unk_04.x * (60 - temp_r31->unk02);
                temp_r31->unk02--;
            }
            if (particle->unk_30 == temp_r27) {
                Hu3DModelAttrReset(temp_r29->unk_00, HU3D_ATTR_PARTICLE_KILL);
                Hu3DModelKill(temp_r29->unk_00);
                return;
            }
            break;
    }
    DCFlushRange(particle->data, particle->unk_30 * sizeof(HU3DPARTICLEDATA));
}

WorkF4B0 *fn_1_F4B0(s16 arg0, s16 arg1)
{
    WorkF4B0 *temp_r31;
    s32 temp_r30;
    ModelData *temp_r29;
    temp_r29 = &Hu3DData[arg0];
    temp_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(WorkF4B0), MEMORY_DEFAULT_NUM);
    temp_r29->unk_120 = temp_r31;
    temp_r31->unk0 = arg0;
    temp_r31->unk2 = arg1;
    temp_r31->unk4 = NULL;
    temp_r31->unk8 = NULL;
    for (temp_r30 = 0; temp_r30 < 32; temp_r30++) {
        temp_r31->unk10[temp_r30] = 0;
    }
    return temp_r31;
}

