mariopartyrd/partyboard/src/REL/m408Dll/stage.c
void fn_1_10830(ModelData *arg0, HSFBITMAP *arg1, HSFATTRIBUTE *arg2, s16 arg3);
void fn_1_10B60(UnkFn10484 *arg0, HSFMATERIAL *arg1);

void fn_1_10484(UnkFn10484 *arg0, HSFFACE *arg1, HsfDrawData *arg2, GXColor *arg3)
{
    HSFMATERIAL *temp_r31;
    HSFOBJECT *temp_r30;
    HSFATTRIBUTE *temp_r29;
    s16 temp_r27;
    s16 temp_r25;
    HsfdrawStruct01 *temp_r24;
    ModelData *temp_r23;
    Hu3DTexAnimDataStruct *temp_r22;
    void *temp_r20;
    GXColor sp14;
    temp_r30 = arg0->unk4;
    temp_r23 = arg0->unk0;
    temp_r31 = &temp_r30->mesh.material[arg1->mat & 0xFFF];
    sp14.r = temp_r31->litColor[0];
    sp14.g = temp_r31->litColor[1];
    sp14.b = temp_r31->litColor[2];
    sp14.a = 255;
    GXSetChanAmbColor(GX_COLOR0A0, sp14);
    sp14.r = temp_r31->color[0];
    sp14.g = temp_r31->color[1];
    sp14.b = temp_r31->color[2];
    sp14.a = 255;
    GXSetChanMatColor(GX_COLOR0A0, sp14);
    if ((temp_r31->invAlpha != 0 || temp_r31->pass == 1) && !(temp_r23->attr & 0x2)) {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_FALSE);
    }
    else {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
    }
    if (temp_r31->attrNum == 0) {
        return;
    }
    temp_r25 = (temp_r30->mesh.color) ? 5 : 1;
    if (arg2->flags & 0x2) {
        temp_r25 |= 0x2;
    }
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSetArray(GX_VA_POS, temp_r30->mesh.vertex->data, sizeof(HuVecF));
    if (temp_r25 & 0x2) {
        GXSetVtxDesc(GX_VA_NBT, GX_DIRECT);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_NBT, GX_NRM_NBT, GX_S16, 8);
    }
    else {
        GXSetVtxDesc(GX_VA_NRM, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_NRM, GX_NRM_XYZ, GX_F32, 0);
        GXSetArray(GX_VA_NRM, temp_r30->mesh.normal->data, sizeof(HuVecF));
    }
    GXSetVtxDesc(GX_VA_TEX0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXSetArray(GX_VA_TEX0, temp_r30->mesh.st->data, sizeof(HuVec2f));
    if (temp_r25 & 0x4) {
        GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
        GXSetArray(GX_VA_CLR0, arg3, sizeof(GXColor));
    }
    GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
    GXSetZCompLoc(GX_FALSE);
    for (temp_r27 = 0; temp_r27 < temp_r31->attrNum; temp_r27++) {
        temp_r29 = &temp_r30->mesh.attribute[temp_r31->attr[temp_r27]];
        if (temp_r29->animWorkP) {
            temp_r24 = temp_r29->animWorkP;
            temp_r22 = &Hu3DTexAnimData[temp_r24->unk02];
            if ((temp_r24->unk00 & 0x1) && !(temp_r22->unk00 & 0x4)) {
                if (Hu3DAnimSet(arg0->unk0, temp_r29, (s16)temp_r27)) {
                    continue;
                }
            }
        }
        fn_1_10830(arg0->unk0, temp_r29->bitmap, temp_r29, (s16)temp_r27);
    }
    fn_1_10B60(arg0, temp_r31);
    temp_r20 = (void *)(arg2->dlOfs + ((u32)lbl_1_bss_120[0]));
    GXCallDisplayList(temp_r20, arg2->dlSize);
}

void fn_1_10830(ModelData *arg0, HSFBITMAP *arg1, HSFATTRIBUTE *arg2, s16 arg3)
{
    GXTexObj sp1C;
    GXTlutObj sp10;
    s16 temp_r29;
    s16 temp_r28;
    s16 temp_r27;
    s16 temp_r26;
    temp_r29 = arg1->sizeX;
    temp_r28 = arg1->sizeY;
    temp_r27 = (arg2->wrapS == 1) ? 1 : 0;
    temp_r26 = (arg2->wrapT == 1) ? 1 : 0;
    switch (arg1->dataFmt) {
        case 6:
            GXInitTexObj(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_RGBA8, temp_r27, temp_r26, GX_FALSE);
            break;

        case 4:
            GXInitTexObj(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_RGB565, temp_r27, temp_r26, GX_FALSE);
            break;

        case 5:
            GXInitTexObj(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_RGB5A3, temp_r27, temp_r26, GX_FALSE);
            break;

        case 9:
            if (arg1->pixSize < 8) {
                GXInitTlutObj(&sp10, arg1->palData, GX_TL_RGB565, arg1->palSize);
                GXLoadTlut(&sp10, arg3);
                GXInitTexObjCI(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_C4, temp_r27, temp_r26, GX_FALSE, arg3);
            }
            else {
                GXInitTlutObj(&sp10, arg1->palData, GX_TL_RGB565, arg1->palSize);
                GXLoadTlut(&sp10, arg3);
                GXInitTexObjCI(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_C8, temp_r27, temp_r26, GX_FALSE, arg3);
            }
            break;

        case 10:
            if (arg1->pixSize < 8) {
                GXInitTlutObj(&sp10, arg1->palData, GX_TL_RGB5A3, arg1->palSize);
                GXLoadTlut(&sp10, arg3);
                GXInitTexObjCI(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_C4, temp_r27, temp_r26, GX_FALSE, arg3);
            }
            else {
                GXInitTlutObj(&sp10, arg1->palData, GX_TL_RGB5A3, arg1->palSize);
                GXLoadTlut(&sp10, arg3);
                GXInitTexObjCI(&sp1C, arg1->data, temp_r29, temp_r28, GX_TF_C8, temp_r27, temp_r26, GX_FALSE, arg3);
            }
            break;
    }
    if (arg0->attr & 0x40) {
        GXInitTexObjLOD(&sp1C, GX_NEAR, GX_NEAR, 0, 0, 0, GX_FALSE, GX_FALSE, GX_ANISO_1);
    }
    else {
        GXInitTexObjLOD(&sp1C, GX_LINEAR, GX_LINEAR, 0, 0, 0, GX_FALSE, GX_FALSE, GX_ANISO_1);
    }
    GXLoadTexObj(&sp1C, arg3);
}

#define SET_TEVCOLOR_ALPHA(reg, color_var, value)                                                                                                    \
    {                                                                                                                                                \
        color_var.a = (value);                                                                                                                       \
        GXSetTevColor(reg, color_var);                                                                                                               \
    }

extern u32 texMtxTbl[];

void fn_1_10B60(UnkFn10484 *arg0, HSFMATERIAL *arg1)
{
    GXColor sp28;
    GXColor sp24;
    GXColor sp20;
    u16 temp_r31;
    HSFATTRIBUTE *temp_r29;
    u16 temp_r28;
    HSFOBJECT *temp_r27;
    HsfdrawStruct01 *temp_r26;
    u16 temp_r25;
    u16 temp_r24;
    s32 temp_r23;
    s32 temp_r22;
    u16 temp_r20;
    temp_r27 = arg0->unk4;
    if (arg1->vtxMode == 2 || arg1->vtxMode == 3) {
        temp_r24 = 1;
    }
    else {
        temp_r24 = 0;
        if (arg1->vtxMode == 0 && !temp_r27->mesh.color) {
            temp_r23 = 0;
        }
        else {
            temp_r23 = 1;
        }
    }

    if (arg1->attrNum == 1) {
        temp_r28 = temp_r31 = 1;
        temp_r29 = &temp_r27->mesh.attribute[arg1->attr[0]];
        GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
        if (temp_r29->animWorkP) {
            temp_r26 = temp_r29->animWorkP;
            if (temp_r26->unk00 & 0x2) {
                GXLoadTexMtxImm(Hu3DTexScrData[temp_r26->unk04].unk3C, GX_TEXMTX0, GX_MTX2x4);
                GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_TEXMTX0);
            }
        }
        if (temp_r29->unk8[2] == 0) {
            GXSetTevOp(GX_TEVSTAGE0, GX_PASSCLR);
            GXSetTevOrder(temp_r31, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
            GXSetTevColorIn(temp_r31, GX_CC_CPREV, GX_CC_TEXC, GX_CC_TEXA, GX_CC_ZERO);
            GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_KONST);
            GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            temp_r31++;
        }
        else {
            GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
            GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_TEXC, GX_CC_RASC, GX_CC_ZERO);
            GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_TEXA);
            GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
        }
        SET_TEVCOLOR_ALPHA(GX_TEVREG0, sp28, 255 * (1.0f - arg1->invAlpha));
        if (temp_r24) {
            GXSetTevOrder(temp_r31, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR1A1);
            GXSetTevColorIn(temp_r31, GX_CC_CPREV, GX_CC_ONE, GX_CC_RASC, GX_CC_ZERO);
            GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_APREV, GX_CA_A0, GX_CA_ZERO);
            GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            temp_r31++;
        }
        else if (0.0f != arg1->invAlpha) {
            GXSetTevOrder(temp_r31, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR0A0);
            GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_CPREV);
            GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_APREV, GX_CA_RASA, GX_CA_ZERO);
            GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            temp_r31++;
        }
        GXSetNumTexGens(temp_r28);
        GXSetNumTevStages(temp_r31);
    }
    else {
        temp_r22 = 0;
        temp_r28 = 1;
        GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
        for (temp_r25 = temp_r31 = 0; temp_r25 < arg1->attrNum; temp_r31++, temp_r25++) {
            temp_r29 = &temp_r27->mesh.attribute[arg1->attr[temp_r25]];
            if (0.0f != temp_r29->nbtTpLvl) {
                GXSetTexCoordGen(GX_TEXCOORD1, GX_TG_BUMP0, GX_TG_TEXCOORD0, GX_IDENTITY);
                SET_TEVCOLOR_ALPHA(GX_TEVREG1, sp24, 10 * temp_r29->nbtTpLvl);
                GXSetTevOrder(temp_r31, GX_TEXCOORD0, temp_r25, GX_COLOR0A0);
                GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_TEXC, GX_CC_A1, GX_CC_RASC);
                GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
                GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO);
                GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_FALSE, GX_TEVPREV);
                temp_r31++;
                GXSetTevOrder(temp_r31, GX_TEXCOORD1, temp_r25, GX_COLOR0A0);
                GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_TEXC, GX_CC_A1, GX_CC_CPREV);
                GXSetTevColorOp(temp_r31, GX_TEV_SUB, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
                GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO);
                GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_FALSE, GX_TEVPREV);
                temp_r28++;
                temp_r22 = 1;
            }
            else {
                if (temp_r29->animWorkP) {
                    temp_r26 = temp_r29->animWorkP;
                    if (temp_r26->unk00 & 0x2) {
                        GXLoadTexMtxImm(Hu3DTexScrData[temp_r26->unk04].unk3C, texMtxTbl[temp_r28], GX_MTX2x4);
                        GXSetTexCoordGen(temp_r28, GX_TG_MTX2x4, GX_TG_TEX0, texMtxTbl[temp_r28]);
                        temp_r20 = (u16)temp_r28;
                        temp_r28++;
                    }
                }
                else {
                    temp_r20 = 0;
                }
                GXSetTevOrder(temp_r31, temp_r20, temp_r25, GX_COLOR0A0);
                if (temp_r25 == 0) {
                    GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_TEXC, GX_CC_RASC, GX_CC_ZERO);
                    GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_TEXA);
                }
                else if (temp_r22 != 0) {
                    GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_CPREV, GX_CC_TEXC, GX_CC_ZERO);
                    GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_TEXA);
                    temp_r22 = 0;
                }
                else if (temp_r29->unk8[2] == 0) {
                    GXSetTevColorIn(temp_r31, GX_CC_CPREV, GX_CC_TEXC, GX_CC_TEXA, GX_CC_ZERO);
                    GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_APREV);
                }
                else {
                    SET_TEVCOLOR_ALPHA(GX_TEVREG2, sp20, 255 * temp_r29->kColor);
                    GXSetTevColorIn(temp_r31, GX_CC_CPREV, GX_CC_TEXC, GX_CC_A2, GX_CC_ZERO);
                    GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_TEXA, GX_CA_APREV, GX_CA_ZERO);
                }
                GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
                GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            }
        }
        SET_TEVCOLOR_ALPHA(GX_TEVREG0, sp28, 255 * (1.0f - arg1->invAlpha));
        if (temp_r24) {
            GXSetTevOrder(temp_r31, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR1A1);
            GXSetTevColorIn(temp_r31, GX_CC_CPREV, GX_CC_ONE, GX_CC_RASC, GX_CC_ZERO);
            GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_APREV, GX_CA_A0, GX_CA_ZERO);
            GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            temp_r31++;
        }
        else {
            GXSetTevOrder(temp_r31, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR0A0);
            GXSetTevColorIn(temp_r31, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_CPREV);
            GXSetTevColorOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            GXSetTevAlphaIn(temp_r31, GX_CA_ZERO, GX_CA_APREV, GX_CA_A0, GX_CA_ZERO);
            GXSetTevAlphaOp(temp_r31, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
            temp_r31++;
        }
        GXSetNumTexGens(temp_r28);
        GXSetNumTevStages(temp_r31);
    }
    lbl_1_bss_118 = Hu3DLightSet(arg0->unk0, &Hu3DCameraMtx, &Hu3DCameraMtxXPose, (temp_r24) ? arg1->hiliteScale : 0);
    if (temp_r24) {
        GXSetNumChans(2);
        if (temp_r27->mesh.color) {
            GXSetChanCtrl(GX_COLOR0A0, GX_TRUE, GX_SRC_REG, GX_SRC_VTX, lbl_1_bss_118, GX_DF_CLAMP, GX_AF_NONE);
            GXSetChanCtrl(GX_COLOR1A1, GX_TRUE, GX_SRC_REG, GX_SRC_VTX, lbl_1_bss_118, GX_DF_NONE, GX_AF_SPEC);
        }
        else {
            GXSetChanCtrl(GX_COLOR0A0, GX_TRUE, GX_SRC_REG, GX_SRC_REG, lbl_1_bss_118, GX_DF_CLAMP, GX_AF_NONE);
            GXSetChanCtrl(GX_COLOR1A1, GX_TRUE, GX_SRC_REG, GX_SRC_REG, lbl_1_bss_118, GX_DF_NONE, GX_AF_SPEC);
        }
    }
    else {
        GXSetNumChans(1);
        if (temp_r27->mesh.color) {
            GXSetChanCtrl(GX_COLOR0A0, temp_r23, GX_SRC_REG, GX_SRC_VTX, lbl_1_bss_118, GX_DF_CLAMP, GX_AF_SPOT);
        }
        else {
            GXSetChanCtrl(GX_COLOR0A0, temp_r23, GX_SRC_REG, GX_SRC_REG, lbl_1_bss_118, GX_DF_CLAMP, GX_AF_SPOT);
        }
    }
}
#undef SET_TEVCOLOR_ALPHA

s32 fn_1_11670(void)
{
    lbl_1_data_19C *= 0x41C64E6D;
    lbl_1_data_19C += 0x3039;
    return lbl_1_data_19C >> 16;
}

float fn_1_116C4(float arg0, float arg1)
{
    float temp_f31;
    float temp_f30;
    temp_f30 = 360;
    temp_f31 = atan2d(arg0, arg1);
    if (temp_f31 < -180) {
        temp_f31 += temp_f30;
    }
    else if (temp_f31 >= 180.0) {
        temp_f31 -= temp_f30;
    }
    return temp_f31;
}

float fn_1_11780(Vec *arg0, Vec *arg1)
{
    return VECDistanceXYZ(arg0, arg1);
}
